Repository: Mahm0ud-Ahmed/delivery_challenge
Catalog: lib/src/core/config/l10n/intl_*.arb
Languages: ar

# app_name
source: Delivery Challenge
ar: توصيل

# login_page_headline
source: Welcome back!
ar: مرحبا بك مجدداً

# login_page_sub_headline
source: Log back into your account
ar: تسجيل الدخول مرة أخرى إلى حسابك.

# login_page_user_id_placeholder
source: User ID
ar: معرف المستخدم

# login_page_password_placeholder
source: Password
ar: كلمة المرور

# login_page_login_button
source: Log in
ar: تسجيل الدخول

# login_page_show_more
source: Show More
ar: عرض المزيد

# alert_dialog_title
source: choose Language
ar: اختر اللغة

# alert_dialog_apply
source: Apply
ar: تطبيق

# home_page_tab_bar_new
source: New
ar: جديد

# home_page_tab_bar_others
source: Others
ar: أخرى

# home_page_status
source: Status
ar: الحالة

# home_page_total_price
source: Total Price
ar: السعر الإجمالي

# home_page_date
source: Date
ar: التاريخ

# home_page_details
source: Order Details
ar: تفاصيل الطلب

# login_page_user_id_error
source: User ID is required
ar: معرف المستخدم مطلوب

# login_page_password_error
source: Password is required
ar: كلمة المرور مطلوبة

# price_order
source: {percent} LE
ar: {percent} ج.م

# no_item_found_title
source: No orders yet
ar: لا توجد طلبات بعد

# no_item_found_subtitle
source: You don't have any orders in your history.
ar: ليس لديك أي طلبات مؤرخة.

# continue_100_message
source: Continue with request
ar: تابع مع الطلب

# switching_protocols_101_message
source: Switching protocols
ar: جارٍ تبديل البروتوكولات

# processing_102_message
source: Processing request
ar: جارٍ معالجة الطلب

# reset_content_205_message
source: Request successful, document reset
ar: تم الطلب بنجاح، إعادة تعيين المستند

# partial_content_206_message
source: Partial content provided
ar: تم تقديم محتوى جزئي

# multiple_choices_300_message
source: Multiple choices available
ar: تتوفر خيارات متعددة

# moved_permanently_301_message
source: Resource permanently moved
ar: تم نقل المورد بشكل دائم

# found_302_message
source: Resource temporarily moved
ar: تم نقل المورد مؤقتًا

# see_other_303_message
source: Response found under different URI
ar: يمكن العثور على الاستجابة تحت URI مختلف

# not_modified_304_message
source: The resource has not been modified since the last request
ar: لم يتم تعديل المورد منذ الطلب السابق

# use_proxy_305_message
source: The requested resource must be accessed through the proxy specified in the Location header
ar: يجب الوصول إلى المورد المطلوب من خلال البروكسي المحدد في رأس الموقع

# temporary_redirect_307_message
source: The requested resource is temporarily available at a different URI
ar: المورد المطلوب متاح مؤقتًا في عنوان URI مختلف

# permanent_redirect_308_message
source: The requested resource has been permanently moved to a different URI
ar: تم نقل المورد المطلوب بشكل دائم إلى عنوان URI مختلف

# unauthorized_401_message
source: The request requires authentication or the user is not authorized to access the resource
ar: الطلب يتطلب المصادقة أو المستخدم ليس لديه الصلاحية للوصول إلى المورد

# payment_required_402_message
source: Payment is required to complete this action. Please make sure your payment information is up to date and try again
ar: مطلوب الدفع لإكمال هذا الإجراء. يرجى التأكد من صحة معلومات الدفع الخاصة بك والمحاولة مرة أخرى

# forbidden_403_message
source: The server refuses to authorize the request
ar: يرفض الخادم المصادقة على الطلب

# not_found_404_message
source: The requested resource could not be found on the server
ar: تعذر العثور على المورد المطلوب على الخادم

# method_not_allowed_405_message
source: The requested method is not allowed for the specified resource
ar: الطريقة المطلوبة غير مسموحة لهذا المورد

# not_acceptable_406_message
source: The server cannot produce a response matching the list of acceptable values defined in the request's headers
ar: الخادم غير قادر على إنتاج إستجابة تتطابق مع القائمة المقبولة المحددة في رؤوس الطلب

# proxy_authentication_required_407_message
source: The client must first authenticate itself with the proxy
ar: يجب على العميل المصادقة على نفسه أولاً مع الوكيل

# request_timeout_408_message
source: The server timed out waiting for the request
ar: انتهت صلاحية الخادم في انتظار الطلب

# conflict_409_message
source: The request could not be completed due to a conflict with the current state of the resource
ar: لا يمكن إكمال الطلب بسبب صدام مع الحالة الحالية للمورد

# gone_410_message
source: The requested resource is no longer available and has been permanently removed
ar: المورد المطلوب غير متوفر بعد و تم حذفه بشكل دائم

# length_required_411_message
source: The request did not specify the length of its content, which is required by the requested resource
ar: لم يحدد الطلب طول محتواه، وهو مطلوب من المورد المطلوب

# precondition_failed_412_message
source: The server does not meet one of the preconditions that the requester put on the request
ar: الخادم لا يستوفي أحد الشروط الأساسية التي وضعها المرسل على الطلب

# requestEntity_tooLarge_413_message
source: The request is larger than the server is willing or able to process
ar: الطلب أكبر من ما يمكن للخادم معالجته

# requestUri_tooLong_414_message
source: The URI provided in the request is too long for the server to process
ar: عنوان URI المقدم في الطلب طويل جدًا بحيث يتعذر على الخادم معالجته

# unsupported_media_type_415_message
source: The server does not support the media type transmitted in the request
ar: الخادم لا يدعم نوع الوسائط الذي يتم نقله في الطلب

# requested_range_not_satisfiable_416_message
source: The requested range cannot be provided by the server
ar: لا يمكن توفير النطاق المطلوب من قبل الخادم

# expectation_failed_417_message
source: The server cannot meet the requirements of the Expect header field
ar: الخادم غير قادر على تلبية متطلبات حقل تروق الرأسية

# misdirected_request_421_message
source: The server was unable to resolve the provided hostname
ar: الخادم غير قادر على حل اسم المضيف المقدم

# unprocessable_entity_422_message
source: The request was well-formed but was unable to be followed due to semantic errors
ar: الطلب صحيح التنسيق ولكن لا يمكن اتباعه بسبب أخطاء دلالية

# locked_423_message
source: The requested resource is locked and may not be modified
ar: تم قفل المورد المطلوب ولا يمكن تعديله

# failed_dependency_424_message
source: The server encountered a failure while attempting to fulfill the request
ar: واجه الخادم خطأ أثناء محاولة تلبية الطلب

# upgrade_required_426_message
source: The client should switch to a different protocol such as TLS/1.0, given in the Upgrade header field
ar: يجب على العميل التحويل إلى بروتوكول مختلف مثل TLS/1.0، الذي يتم تقديمه في حقل ترقية الرأسية

# precondition_required_428_message
source: The server requires the request to be conditional
ar: يتطلب الخادم أن يكون الطلب مشروطًا

# too_many_requests_429_message
source: The user has sent too many requests in a given amount of time
ar: أرسل المستخدم الكثير من الطلبات في فترة زمنية محددة

# request_header_fields_too_large_431_message
source: The server is unwilling to process the request because its header fields are too large
ar: الخادم غير راغب في معالجة الطلب لأن حقول رأسه كبيرة جدًا

# connection_closed_without_response_444_message
source: The server has closed the connection without sending any response
ar: أغلق الخادم الاتصال دون إرسال أي رد

# unavailable_for_legal_reasons_451_message
source: The server is denying access to the resource as a consequence of a legal demand
ar: يرفض الخادم الوصول إلى المورد نتيجة لطلب قانوني

# client_closed_request_499_message
source: he client has closed the request before the server could send a response
ar: أغلق العميل الطلب قبل أن يتمكن الخادم من إرسال رد

# internal_server_error_500_message
source: The server encountered an error while processing the request
ar: واجه الخادم خطأ أثناء معالجة الطلب

# not_implemented_error_501_message
source: The server does not support the functionality required to fulfill the request
ar: الخادم لا يدعم الوظيفة المطلوبة لتنفيذ الطلب

# bad_gateway_502_message
source: The server acting as a gateway or proxy received an invalid response from the upstream server
ar: تلقى الخادم العامل كمعوّل أو بروكسي استجابة غير صالحة من الخادم الأعلى

# service_unavailable_503_message
source: The server is currently unavailable
ar: الخادم غير متاح حاليًا

# gateway_timeout_504_message
source: The server acting as a gateway or proxy timed out waiting for a response from the upstream server
ar: الخادم لا يستجيب في الوقت المحدد. يرجى المحاولة مرة أخرى في وقت لاحق

# http_version_not_supported_505_message
source: The requested HTTP version is not supported by the server
ar: الإصدار المطلوب من بروتوكول HTTP غير معتمد من قبل الخادم

# variant_also_negotiates_506_message
source: The server has detected an infinite loop while processing the request
ar: اكتشف الخادم حلقة لانهائية أثناء معالجة الطلب

# insufficient_storage_507_message
source: The server is unable to store the representation needed to complete the request
ar: الخادم غير قادر على تخزين التمثيل الذي يلزم لإكمال الطلب

# loop_detected_508_message
source: The server has detected a loop in the request processing chain, which could indicate a misconfiguration
ar: اكتشف الخادم حلقة في سلسلة معالجة الطلبات ، والتي يمكن أن تشير إلى عدم تكوين صحيح

# not_extended_510_message
source: Further extensions to the request are required for the server to fulfill it
ar: تتطلب المزيد من التمديدات للطلب لكي يتم استيفاءه من قبل الخادم

# network_authentication_required_511_message
source: The client needs to authenticate to gain network access
ar: العميل بحاجة إلى التحقق من الهوية للوصول إلى الشبكة

# network_connect_timeout_error_599_message
source: The request has timed out while connecting to the server. Please check your network connection and try again
ar: انتهت مهلة الطلب أثناء الاتصال بالخادم. يرجى التحقق من اتصال الشبكة الخاص بك والمحاولة مرة أخرى

# connect_timeout_message
source: Connection timed out. Please check your internet connection and try again
ar: انتهت مهلة الاتصال. يرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى

# send_timeout_message
source: Sending request timed out. Please try again
ar: انتهت مهلة إرسال الطلب. يرجى المحاولة مرة أخرى

# receive_timeout_message
source: Receiving response timed out. Please try again
ar: انتهت مهلة استلام الرد. يرجى المحاولة مرة أخرى

# connection_error_message
source: Unable to establish a connection. Please check your internet connection and try again
ar: غير قادر على إنشاء اتصال. يرجى التحقق من اتصال الإنترنت الخاص بك والمحاولة مرة أخرى

# cancel_error_message
source: Request has been canceled
ar: تم إلغاء الطلب

# unknown_error_message
source: An unknown error has occurred. Please try again later
ar: حدث خطأ غير معروف. يرجى المحاولة مرة أخرى في وقت لاحق

# bad_certificate_message
source: Certificate verification failed. Please make sure you're connected to a secure network and try again
ar: فشل التحقق من الشهادة. يرجى التأكد من أنك متصل بشبكة آمنة والمحاولة مرة أخرى

# check_connection_message
source: Check your internet connection
ar: تحقق من اتصالك بالانترنت

# error_occurred_while_processing_the_data_received_from_the_server_message
source: An error occurred while processing the data received from the server, as expected in the application
ar: خطأ في معالجة البيانات القادمة من السيرفر، والمتوقعة في التطبيق
